# Perform all scaling algorithms

In [101]:
'''importing datas'''

import pandas as pd
df=pd.read_csv('supershops.csv')

In [102]:
df.head() # will display first 5 values

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [103]:
 x= df.drop('Profit',axis=1) #seperating y (profit) from x values

In [104]:
y = df[['Profit']] # keeping profit in y

In [105]:
x.head()

   Marketing Spend  Administration  Transport     Area
0        114523.61       136897.80  471784.10    Dhaka
1        162597.70       151377.59  443898.53      Ctg
2        153441.51       101145.55  407934.54  Rangpur
3        144372.41       118671.85  383199.62    Dhaka
4        142107.34        91391.77  366168.42  Rangpur

In [106]:
x1 = x.copy() # keeping x values in x1
x2 = x.copy() # keeping x values in x2
x3 = x.copy()
x4 = x.copy()
x5 = x.copy()
x6 = x.copy()
x7 = x.copy()
x8 = x.copy()

In [107]:
x1.head(8)

   Marketing Spend  Administration  Transport     Area
0        114523.61       136897.80  471784.10    Dhaka
1        162597.70       151377.59  443898.53      Ctg
2        153441.51       101145.55  407934.54  Rangpur
3        144372.41       118671.85  383199.62    Dhaka
4        142107.34        91391.77  366168.42  Rangpur
5        131876.90        99814.71  362861.36    Dhaka
6        134615.46       147198.87  127716.82      Ctg
7        130298.13       145530.06  323876.68  Rangpur

In [108]:
from sklearn.preprocessing import MinMaxScaler
m = MinMaxScaler()

In [109]:
#cols_to_norm = ['Marketing Spend','Administration','Transport']

In [110]:
#x1[cols_to_norm] = m.fit_transform(x1[cols_to_norm])

In [111]:
#x1[['Marketing Spend']]=m.fit_transform(x1[['Marketing Spend']]) # fit transform together

In [112]:
#x1.head()

In [113]:
import numpy as np

# Normalization

In [114]:
cols_to_norm = x1.select_dtypes(np.number).columns # will normalize the columns containing numbers only
x1[cols_to_norm]=m.fit_transform(x1[cols_to_norm]) # it will train the data first and then will normalize the data

In [115]:
x1.head()

   Marketing Spend  Administration  Transport     Area
0         0.692617        0.651744   1.000000    Dhaka
1         0.983359        0.761972   0.940893      Ctg
2         0.927985        0.379579   0.864664  Rangpur
3         0.873136        0.512998   0.812235    Dhaka
4         0.859438        0.305328   0.776136  Rangpur

In [137]:
#x1.info()

# Standardization

In [138]:
from sklearn.preprocessing import StandardScaler
StdScl = StandardScaler()

In [119]:
cols_to_norm2 = x2.select_dtypes(np.number).columns # will normalize the columns containing numbers only
x2[cols_to_norm2]=StdScl.fit_transform(x2[cols_to_norm2])

In [120]:
x2.head()

   Marketing Spend  Administration  Transport     Area
0         0.897913        0.560753   2.165287    Dhaka
1         1.955860        1.082807   1.929843      Ctg
2         1.754364       -0.728257   1.626191  Rangpur
3         1.554784       -0.096365   1.417348    Dhaka
4         1.504937       -1.079919   1.273550  Rangpur

In [121]:
#x3[['Marketing Spend']]=StdScl.fit_transform(x3[['Marketing Spend']]) # fit transform together

In [122]:
#x3.head()

In [123]:
#x3[['Administration']]=StdScl.fit_transform(x3[['Administration']])

In [124]:
#x3.head()

# Max Absolute Scaler

In [100]:
from sklearn.preprocessing import MaxAbsScaler
MaxAbs = MaxAbsScaler()

In [125]:
cols_to_norm4 = x4.select_dtypes(np.number).columns # will normalize the columns containing numbers only
x4[cols_to_norm4]=MaxAbs.fit_transform(x4[cols_to_norm4])

In [126]:
x4.head()

   Marketing Spend  Administration  Transport     Area
0         0.692617        0.749527   1.000000    Dhaka
1         0.983359        0.828805   0.940893      Ctg
2         0.927985        0.553781   0.864664  Rangpur
3         0.873136        0.649738   0.812235    Dhaka
4         0.859438        0.500378   0.776136  Rangpur

# Robust Scaler

In [129]:
from sklearn.preprocessing import RobustScaler
Rob = RobustScaler()

In [130]:
cols_to_norm5 = x5.select_dtypes(np.number).columns # will normalize the columns containing numbers only
x5[cols_to_norm5]=Rob.fit_transform(x5[cols_to_norm5])

In [131]:
x5.head()

   Marketing Spend  Administration  Transport     Area
0         0.672530        0.345355   1.552016    Dhaka
1         1.452113        0.697565   1.383714      Ctg
2         1.303634       -0.524290   1.166654  Rangpur
3         1.156567       -0.097977   1.017368    Dhaka
4         1.119836       -0.761543   0.914576  Rangpur